# SQL Assignment 4

Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [1]:
import mysql.connector as connection
import pandas as pandas

try:
    mydb = connection.connect(host="localhost", database = 'ORG',user="root", passwd="root",use_pure=True)
    query = "Select REPLACE(FIRST_NAME,'a','A') from Worker"
    result_dataFrame = pandas.read_sql(query,mydb)
    print(result_dataFrame)
    mydb.close()
except Exception as e:
    mydb.close()
    print(str(e))

  REPLACE(FIRST_NAME,'a','A')
0                      MonikA
1                    NihArikA
2                      VishAl
3                     AmitAbh
4                       Vivek
5                       Vipul
6                      SAtish
7                     GeetikA

Q-2. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [4]:
import mysql.connector as connection
import pandas as pandas

try:
    mydb = connection.connect(host="localhost", database = 'ORG',user="root", passwd="root",use_pure=True)
    query = "Select * from Worker order by FIRST_NAME asc, DEPARTMENT desc;"
    result_dataFrame = pandas.read_sql(query,mydb)
    print(result_dataFrame)
    mydb.close()
except Exception as e:
    mydb.close()
    print(str(e))

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
1          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
2          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
3          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
4          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
7          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin

Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.

In [8]:
import mysql.connector as connection
import pandas as pandas

try:
    mydb = connection.connect(host="localhost", database = 'ORG',user="root", passwd="root",use_pure=True)
    query = "SELECT CONCAT(FIRST_NAME,' ',LAST_NAME) as 'WORKER_NAME', SALARY from Worker WHERE SALARY=(SELECT max(SALARY) from Worker);"
    result_dataFrame = pandas.read_sql(query,mydb)
    print(result_dataFrame)
    mydb.close()
except Exception as e:
    mydb.close()
    print(str(e))

     WORKER NAME  SALARY
0  Amitabh Singh  500000
1    Vivek Bhati  500000